{"input": "Посоветуйте ноутбук для 3D-графики, чтобы вложиться в 50 тысяч.", "output": "Для 3D-графики с бюджетом до 50 тысяч рублей подойдёт Acer Aspire 7 A715-42G. Его цена около 49 990 рублей."}
{"input": "Ищу лэптоп для создания 3D моделей, максимум 100 тысяч рублей.", "output": "Для создания 3D моделей с бюджетом до 100 тысяч рублей подойдёт ASUS TUF Gaming F15 (FX506HE). Его цена около 96 000 рублей."}
{"input": "Нужен ноутбук, чтобы моделировать 3D сцены. Бюджет до 200 тыс.", "output": "Для моделирования 3D сцен с бюджетом до 200 тысяч рублей подойдёт Lenovo Legion 5 Pro (16ACH6H). Его цена около 195 000 рублей."}
{"input": "Можете подсказать ноутбук для 3D, деньги не ограничены?", "output": "Для 3D моделирования без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Какой ноутбук подойдёт для редактирования видео в пределах 50к?", "output": "Для редактирования видео с бюджетом до 50 тысяч рублей подойдёт HP Pavilion 15-cs3000. Его цена около 48 990 рублей."}
{"input": "Мне нужен компьютер для монтажа видео до 100 тысяч. Что выбрать?", "output": "Для монтажа видео с бюджетом до 100 тысяч рублей подойдёт Dell Inspiron 15 5510. Его цена около 99 000 рублей."}
{"input": "Ищу устройство для профессионального видеомонтажа с бюджетом 200к.", "output": "Для профессионального видеомонтажа с бюджетом до 200 тысяч рублей подойдёт MSI Creator Z16. Его цена около 199 000 рублей."}
{"input": "Подскажите, какой ноутбук взять для работы с видео, если деньги не вопрос?", "output": "Для работы с видео без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Какой недорогой ноутбук посоветуете для создания музыки?", "output": "Для создания музыки с бюджетом до 50 тысяч рублей подойдёт ASUS VivoBook 15. Его цена около 47 990 рублей."}
{"input": "Посоветуйте лэптоп для работы с аудио, до 100 тысяч рублей.", "output": "Для работы с аудио с бюджетом до 100 тысяч рублей подойдёт Lenovo IdeaPad 5 15ARE05. Его цена около 98 000 рублей."}
{"input": "Мне нужен ноутбук, чтобы сводить звук. Есть до 200к рублей.", "output": "Для сведения звука с бюджетом до 200 тысяч рублей подойдёт Apple MacBook Air 15\" (M2). Его цена около 190 000 рублей."}
{"input": "Рекомендую хороший ноутбук для работы со звуком, бюджет любой.", "output": "Для работы со звуком без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Посоветуйте ноутбук для обработки фотографий, уложиться в 50к.", "output": "Для обработки фотографий с бюджетом до 50 тысяч рублей подойдёт Lenovo IdeaPad 3 15ADA6. Его цена около 48 000 рублей."}
{"input": "Хочу взять ноут для работы с фото, максимум 100 тысяч. Что выбрать?", "output": "Для работы с фото с бюджетом до 100 тысяч рублей подойдёт ASUS ZenBook 14. Его цена около 99 000 рублей."}
{"input": "Ищу лэптоп для редактирования фотографий до 200 тысяч рублей.", "output": "Для редактирования фотографий с бюджетом до 200 тысяч рублей подойдёт Dell XPS 15. Его цена около 199 000 рублей."}
{"input": "Подскажите топовый ноутбук для работы с фото. Бюджет не ограничен.", "output": "Для работы с фотографиями без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Какой ноут выбрать для игр за 50к?", "output": "Для игр с бюджетом до 50 тысяч рублей подойдёт Acer Nitro 5 AN515-43. Его цена около 50 000 рублей."}
{"input": "Хочу купить игровой ноутбук в пределах 100 тысяч. Что порекомендуете?", "output": "Для игр с бюджетом до 100 тысяч рублей подойдёт MSI GF63 Thin. Его цена около 99 000 рублей."}
{"input": "Рекомендую мощный игровой лэптоп до 200 тысяч рублей.", "output": "Для игр с бюджетом до 200 тысяч рублей подойдёт ASUS ROG Zephyrus G14. Его цена около 199 000 рублей."}
{"input": "Какой ноутбук взять для игр, если денег не жалко?", "output": "Для игр без ограничений по бюджету подойдёт Alienware x17 R2. Его цена около 450 000 рублей."}
{"input": "Мне нужен ноутбук, чтобы просто в интернете сидеть. Не дороже 50к.", "output": "Для сёрфинга в интернете с бюджетом до 50 тысяч рублей подойдёт ASUS Chromebook Flip C214. Его цена около 38 000 рублей."}
{"input": "Посоветуйте ноутбук для интернет-сёрфинга, есть до 100 тысяч.", "output": "Для интернет-сёрфинга с бюджетом до 100 тысяч рублей подойдёт Huawei MateBook D15. Его цена около 88 000 рублей."}
{"input": "Ищу лэптоп для интернета до 200 тысяч рублей.", "output": "Для сёрфинга с бюджетом до 200 тысяч рублей подойдёт Apple MacBook Air 15\" (M2). Его цена около 190 000 рублей."}
{"input": "Какой ноут взять, чтобы лазить в сети, если бюджет не важен?", "output": "Для интернет-сёрфинга без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Какой ноутбук подойдёт для стриминга игр, бюджет до 50 тысяч?", "output": "Для стриминга игр с бюджетом до 50 тысяч рублей подойдёт Acer Aspire 7 A715-42G. Его цена около 49 990 рублей."}
{"input": "Ищу ноутбук для работы в Blender, до 100 тысяч рублей.", "output": "Для работы в Blender с бюджетом до 100 тысяч рублей подойдёт MSI GF63 Thin. Его цена около 98 000 рублей."}
{"input": "Подскажите ноутбук для видеоконференций, максимум 50 тысяч.", "output": "Для видеоконференций с бюджетом до 50 тысяч рублей подойдёт ASUS VivoBook 14. Его цена около 45 000 рублей."}
{"input": "Мне нужен лэптоп для удалённой работы с тяжёлыми программами, до 200 тысяч.", "output": "Для удалённой работы с тяжёлыми программами с бюджетом до 200 тысяч рублей подойдёт HP ZBook Firefly G8. Его цена около 195 000 рублей."}
{"input": "Какой ноутбук взять для учёбы, чтобы не дороже 30 тысяч?", "output": "Для учёбы с бюджетом до 30 тысяч рублей подойдёт Lenovo IdeaPad 1 14ADA7. Его цена около 28 000 рублей."}
{"input": "Нужен недорогой ноутбук для офисной работы, бюджет до 50к.", "output": "Для офисной работы с бюджетом до 50 тысяч рублей подойдёт ASUS Laptop 15. Его цена около 48 000 рублей."}
{"input": "Посоветуйте устройство для монтажа в DaVinci Resolve. Бюджет 150 тысяч.", "output": "Для монтажа в DaVinci Resolve с бюджетом до 150 тысяч рублей подойдёт Dell G15 5520. Его цена около 145 000 рублей."}
{"input": "Какой ноутбук выбрать для программирования, до 80 тысяч рублей?", "output": "Для программирования с бюджетом до 80 тысяч рублей подойдёт Huawei MateBook D16. Его цена около 78 000 рублей."}
{"input": "Мне нужен ноутбук для просмотра фильмов, не дороже 40 тысяч.", "output": "Для просмотра фильмов с бюджетом до 40 тысяч рублей подойдёт HP Stream 14. Его цена около 39 000 рублей."}
{"input": "Подскажите лэптоп для разработки игр, до 200 тысяч рублей.", "output": "Для разработки игр с бюджетом до 200 тысяч рублей подойдёт ASUS ROG Zephyrus M16. Его цена около 199 000 рублей."}
{"input": "Какой ноутбук взять для работы с CAD-софтом, бюджет 150 тысяч?", "output": "Для работы с CAD-софтом с бюджетом до 150 тысяч рублей подойдёт Dell Precision 3561. Его цена около 149 000 рублей."}
{"input": "Рекомендую ноутбук для веб-разработки, бюджет не более 70к.", "output": "Для веб-разработки с бюджетом до 70 тысяч рублей подойдёт Acer Swift 3. Его цена около 68 000 рублей."}
{"input": "Посоветуйте ноутбук для рисования в Procreate, деньги не важны.", "output": "Для рисования в Procreate без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы с большими таблицами Excel, до 50к?", "output": "Для работы с большими таблицами Excel с бюджетом до 50 тысяч рублей подойдёт Lenovo V15 G2. Его цена около 49 000 рублей."}
{"input": "Мне нужен лэптоп для создания контента в TikTok, до 100 тысяч рублей.", "output": "Для создания контента в TikTok с бюджетом до 100 тысяч рублей подойдёт ASUS ZenBook Flip 14. Его цена около 98 000 рублей."}
{"input": "Какой ноутбук взять для начального уровня программирования, до 30 тысяч?", "output": "Для начального уровня программирования с бюджетом до 30 тысяч рублей подойдёт HP 250 G8. Его цена около 29 000 рублей."}
{"input": "Нужен ноутбук для стриминга фильмов в 4K, до 70 тысяч.", "output": "Для стриминга фильмов в 4K с бюджетом до 70 тысяч рублей подойдёт ASUS VivoBook 15 OLED. Его цена около 68 000 рублей."}
{"input": "Ищу устройство для работы с Python, до 100 тысяч рублей.", "output": "Для работы с Python с бюджетом до 100 тысяч рублей подойдёт Lenovo ThinkBook 14. Его цена около 97 000 рублей."}
{"input": "Подскажите лэптоп для редактирования аудиокниг, бюджет 80 тысяч.", "output": "Для редактирования аудиокниг с бюджетом до 80 тысяч рублей подойдёт Acer Aspire 7 A715. Его цена около 79 000 рублей."}
{"input": "Какой ноутбук подойдёт для вёрстки сайтов, до 50 тысяч?", "output": "Для вёрстки сайтов с бюджетом до 50 тысяч рублей подойдёт Dell Inspiron 3501. Его цена около 49 000 рублей."}
{"input": "Мне нужен ноут для онлайн-курсов, до 40 тысяч рублей.", "output": "Для онлайн-курсов с бюджетом до 40 тысяч рублей подойдёт HP Chromebook 14. Его цена около 38 000 рублей."}
{"input": "Какой ноутбук взять для чтения PDF-файлов, до 30 тысяч рублей?", "output": "Для чтения PDF-файлов с бюджетом до 30 тысяч рублей подойдёт ASUS E210MA. Его цена около 28 000 рублей."}
{"input": "Ищу устройство для редактирования подкастов, до 150 тысяч.", "output": "Для редактирования подкастов с бюджетом до 150 тысяч рублей подойдёт MacBook Air 13\" (M1). Его цена около 145 000 рублей."}
{"input": "Какой ноутбук подойдёт для AutoCAD, до 200 тысяч рублей?", "output": "Для работы в AutoCAD с бюджетом до 200 тысяч рублей подойдёт MSI Katana GF76. Его цена около 198 000 рублей."}
{"input": "Мне нужен игровой ноутбук для киберспорта, до 300 тысяч.", "output": "Для киберспорта с бюджетом до 300 тысяч рублей подойдёт Alienware m15 R6. Его цена около 295 000 рублей."}
{"input": "Посоветуйте ноутбук для домашнего пользования, бюджет до 60 тысяч.", "output": "Для домашнего пользования с бюджетом до 60 тысяч рублей подойдёт Acer Swift 1. Его цена около 58 000 рублей."}
{"input": "Какой ноут взять для монтажа Instagram-видео, до 80 тысяч?", "output": "Для монтажа Instagram-видео с бюджетом до 80 тысяч рублей подойдёт HP Pavilion x360. Его цена около 79 000 рублей."}
{"input": "Ищу ноутбук для обработки больших фотоархивов, до 120 тысяч рублей.", "output": "Для обработки больших фотоархивов с бюджетом до 120 тысяч рублей подойдёт Dell Inspiron 16 Plus. Его цена около 119 000 рублей."}
{"input": "Нужен лэптоп для обучения дизайну, до 90 тысяч рублей.", "output": "Для обучения дизайну с бюджетом до 90 тысяч рублей подойдёт ASUS ZenBook UX425. Его цена около 88 000 рублей."}
{"input": "Какой ноутбук выбрать для чтения и серфинга в сети, до 25 тысяч рублей?", "output": "Для чтения и серфинга в сети с бюджетом до 25 тысяч рублей подойдёт Lenovo IdeaPad 1. Его цена около 24 000 рублей."}
{"input": "Посоветуйте ноут для рендеринга видео, до 250 тысяч рублей.", "output": "Для рендеринга видео с бюджетом до 250 тысяч рублей подойдёт ASUS ProArt StudioBook 16. Его цена около 245 000 рублей."}
{"input": "Ищу лэптоп для стриминга и работы в OBS, бюджет до 150 тысяч.", "output": "Для работы в OBS с бюджетом до 150 тысяч рублей подойдёт HP OMEN 15. Его цена около 148 000 рублей."}
{"input": "Какой ноутбук взять для преподавателя, до 60 тысяч рублей?", "output": "Для преподавателя с бюджетом до 60 тысяч рублей подойдёт Acer Extensa 15. Его цена около 59 000 рублей."}
{"input": "Мне нужен ноутбук для просмотра онлайн-лекций, до 40 тысяч рублей.", "output": "Для просмотра онлайн-лекций с бюджетом до 40 тысяч рублей подойдёт Lenovo IdeaPad 3. Его цена около 39 000 рублей."}
{"input": "Рекомендую мощный ноутбук для глубокого обучения, бюджет 300 тысяч.", "output": "Для глубокого обучения с бюджетом до 300 тысяч рублей подойдёт Razer Blade 15 Advanced. Его цена около 295 000 рублей."}
{"input": "Посоветуйте ноутбук для редактирования презентаций, до 30 тысяч.", "output": "Для редактирования презентаций с бюджетом до 30 тысяч рублей подойдёт ASUS E210MA. Его цена около 28 000 рублей."}
{"input": "Какой ноутбук выбрать для работы с таблицами Excel, до 80 тысяч?", "output": "Для работы с таблицами Excel с бюджетом до 80 тысяч рублей подойдёт HP ProBook 450 G8. Его цена около 78 000 рублей."}
{"input": "Ищу лэптоп для программирования на Java, до 120 тысяч.", "output": "Для программирования на Java с бюджетом до 120 тысяч рублей подойдёт Lenovo ThinkPad E15. Его цена около 118 000 рублей."}
{"input": "Какой ноут взять для работы в Adobe Premiere, бюджет до 200 тысяч?", "output": "Для работы в Adobe Premiere с бюджетом до 200 тысяч рублей подойдёт ASUS ROG Zephyrus G14. Его цена около 198 000 рублей."}
{"input": "Мне нужен ноутбук для лёгких офисных задач, до 40 тысяч.", "output": "Для лёгких офисных задач с бюджетом до 40 тысяч рублей подойдёт Acer Aspire 1. Его цена около 39 000 рублей."}
{"input": "Посоветуйте ноут для игр в CS:GO, до 70 тысяч.", "output": "Для игр в CS:GO с бюджетом до 70 тысяч рублей подойдёт Acer Nitro 5. Его цена около 69 000 рублей."}
{"input": "Какой ноутбук взять для стриминга, бюджет до 150 тысяч рублей?", "output": "Для стриминга с бюджетом до 150 тысяч рублей подойдёт ASUS TUF Gaming F15. Его цена около 145 000 рублей."}
{"input": "Ищу лэптоп для учёбы и работы, до 50 тысяч.", "output": "Для учёбы и работы с бюджетом до 50 тысяч рублей подойдёт Dell Inspiron 3505. Его цена около 48 000 рублей."}
{"input": "Какой ноутбук выбрать для создания анимации, до 100 тысяч?", "output": "Для создания анимации с бюджетом до 100 тысяч рублей подойдёт Lenovo Legion 5. Его цена около 99 000 рублей."}
{"input": "Мне нужен ноутбук для путешествий, до 60 тысяч рублей.", "output": "Для путешествий с бюджетом до 60 тысяч рублей подойдёт ASUS ZenBook 14. Его цена около 59 000 рублей."}
{"input": "Посоветуйте ноут для написания текстов, до 30 тысяч.", "output": "Для написания текстов с бюджетом до 30 тысяч рублей подойдёт HP Chromebook 11. Его цена около 28 000 рублей."}
{"input": "Какой ноутбук подойдёт для чтения книг, до 20 тысяч рублей?", "output": "Для чтения книг с бюджетом до 20 тысяч рублей подойдёт Lenovo Chromebook C340. Его цена около 19 000 рублей."}
{"input": "Ищу устройство для редактирования фотографий, до 70 тысяч.", "output": "Для редактирования фотографий с бюджетом до 70 тысяч рублей подойдёт ASUS VivoBook Pro 15 OLED. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук выбрать для преподавания онлайн, до 100 тысяч?", "output": "Для преподавания онлайн с бюджетом до 100 тысяч рублей подойдёт HP Pavilion 15. Его цена около 98 000 рублей."}
{"input": "Мне нужен ноутбук для домашнего пользования, до 45 тысяч.", "output": "Для домашнего пользования с бюджетом до 45 тысяч рублей подойдёт ASUS VivoBook 15. Его цена около 43 000 рублей."}
{"input": "Посоветуйте ноут для монтажа 4K-видео, до 150 тысяч.", "output": "Для монтажа 4K-видео с бюджетом до 150 тысяч рублей подойдёт MSI Prestige 14. Его цена около 148 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы в MATLAB, до 200 тысяч рублей?", "output": "Для работы в MATLAB с бюджетом до 200 тысяч рублей подойдёт Dell XPS 15. Его цена около 195 000 рублей."}
{"input": "Мне нужен ноутбук для графического дизайна, до 80 тысяч.", "output": "Для графического дизайна с бюджетом до 80 тысяч рублей подойдёт Acer ConceptD 3. Его цена около 79 000 рублей."}
{"input": "Ищу лэптоп для обработки RAW-фотографий, до 150 тысяч рублей.", "output": "Для обработки RAW-фотографий с бюджетом до 150 тысяч рублей подойдёт Apple MacBook Air 13\" (M1). Его цена около 145 000 рублей."}
{"input": "Какой ноутбук выбрать для игр в тяжёлые проекты, до 250 тысяч?", "output": "Для игр в тяжёлые проекты с бюджетом до 250 тысяч рублей подойдёт ASUS ROG Strix Scar 15. Его цена около 248 000 рублей."}
{"input": "Посоветуйте ноут для начинающего видеоблогера, до 70 тысяч рублей.", "output": "Для начинающего видеоблогера с бюджетом до 70 тысяч рублей подойдёт HP Pavilion x360. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук подойдёт для скетчинга, до 120 тысяч рублей?", "output": "Для скетчинга с бюджетом до 120 тысяч рублей подойдёт Microsoft Surface Laptop 4. Его цена около 118 000 рублей."}
{"input": "Мне нужен ноут для редактирования музыки, до 50 тысяч.", "output": "Для редактирования музыки с бюджетом до 50 тысяч рублей подойдёт Lenovo V14. Его цена около 48 000 рублей."}
{"input": "Посоветуйте устройство для 3D-печати, до 100 тысяч рублей.", "output": "Для управления 3D-печатью с бюджетом до 100 тысяч рублей подойдёт Dell G15. Его цена около 99 000 рублей."}
{"input": "Какой ноутбук взять для рендеринга архитектуры, до 200 тысяч?", "output": "Для рендеринга архитектуры с бюджетом до 200 тысяч рублей подойдёт MSI Creator Z16. Его цена около 199 000 рублей."}
{"input": "Ищу ноутбук для начального уровня 3D-моделирования, до 50 тысяч.", "output": "Для начального уровня 3D-моделирования с бюджетом до 50 тысяч рублей подойдёт Acer Aspire 5. Его цена около 49 000 рублей."}
{"input": "Посоветуйте ноут для редактирования подкастов, до 60 тысяч рублей.", "output": "Для редактирования подкастов с бюджетом до 60 тысяч рублей подойдёт Lenovo IdeaPad 3. Его цена около 58 000 рублей."}
{"input": "Какой ноутбук выбрать для начального уровня графического дизайна, до 40 тысяч?", "output": "Для начального уровня графического дизайна с бюджетом до 40 тысяч рублей подойдёт ASUS VivoBook 14. Его цена около 39 000 рублей."}
{"input": "Какой ноутбук подойдёт для редактирования текстов, до 30 тысяч рублей?", "output": "Для редактирования текстов с бюджетом до 30 тысяч рублей подойдёт ASUS VivoBook 14. Его цена около 28 000 рублей."}
{"input": "Мне нужен ноутбук для учёбы в университете, до 50 тысяч.", "output": "Для учёбы в университете с бюджетом до 50 тысяч рублей подойдёт HP 250 G9. Его цена около 48 000 рублей."}
{"input": "Ищу лэптоп для работы с 3D-анимацией, до 150 тысяч рублей.", "output": "Для работы с 3D-анимацией с бюджетом до 150 тысяч рублей подойдёт ASUS ROG Zephyrus G15. Его цена около 148 000 рублей."}
{"input": "Какой ноутбук выбрать для написания научных статей, бюджет 40 тысяч?", "output": "Для написания научных статей с бюджетом до 40 тысяч рублей подойдёт Acer Extensa 15. Его цена около 39 000 рублей."}
{"input": "Посоветуйте ноутбук для создания презентаций, до 50 тысяч рублей.", "output": "Для создания презентаций с бюджетом до 50 тысяч рублей подойдёт Lenovo IdeaPad 3. Его цена около 48 000 рублей."}
{"input": "Мне нужен лэптоп для преподавания, до 70 тысяч рублей.", "output": "Для преподавания с бюджетом до 70 тысяч рублей подойдёт ASUS VivoBook 15. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук подойдёт для домашней работы, до 90 тысяч рублей?", "output": "Для домашней работы с бюджетом до 90 тысяч рублей подойдёт Huawei MateBook D14. Его цена около 88 000 рублей."}
{"input": "Ищу устройство для редактирования текстов и таблиц, до 35 тысяч.", "output": "Для редактирования текстов и таблиц с бюджетом до 35 тысяч рублей подойдёт HP Stream 14. Его цена около 33 000 рублей."}
{"input": "Подскажите ноутбук для старшеклассника, до 50 тысяч рублей.", "output": "Для старшеклассника с бюджетом до 50 тысяч рублей подойдёт Lenovo IdeaPad 1. Его цена около 49 000 рублей."}
{"input": "Какой лэптоп взять для удалённой работы, до 60 тысяч рублей?", "output": "Для удалённой работы с бюджетом до 60 тысяч рублей подойдёт Acer Aspire 5. Его цена около 59 000 рублей."}
{"input": "Какой ноутбук подойдёт для школьника, до 30 тысяч рублей?", "output": "Для школьника с бюджетом до 30 тысяч рублей подойдёт Lenovo Chromebook C340. Его цена около 28 000 рублей."}
{"input": "Ищу ноутбук для начального уровня программирования, до 50 тысяч рублей.", "output": "Для начального уровня программирования с бюджетом до 50 тысяч рублей подойдёт Acer Aspire 3. Его цена около 49 000 рублей."}
{"input": "Подскажите ноутбук для семейного использования, до 70 тысяч рублей.", "output": "Для семейного использования с бюджетом до 70 тысяч рублей подойдёт HP Pavilion 15. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук взять для хранения и просмотра фотографий, до 100 тысяч рублей?", "output": "Для хранения и просмотра фотографий с бюджетом до 100 тысяч рублей подойдёт Dell Inspiron 15 3511. Его цена около 98 000 рублей."}
{"input": "Нужен ноутбук для игр на минимальных настройках, до 50 тысяч рублей.", "output": "Для игр на минимальных настройках с бюджетом до 50 тысяч рублей подойдёт ASUS TUF Dash F15. Его цена около 49 000 рублей."}
{"input": "Какой лэптоп выбрать для видеоблогинга, до 80 тысяч рублей?", "output": "Для видеоблогинга с бюджетом до 80 тысяч рублей подойдёт ASUS VivoBook Flip 14. Его цена около 78 000 рублей."}
{"input": "Ищу устройство для монтажа подкастов, до 150 тысяч рублей.", "output": "Для монтажа подкастов с бюджетом до 150 тысяч рублей подойдёт Apple MacBook Air 13\" (M1). Его цена около 145 000 рублей."}
{"input": "Подскажите ноутбук для создания иллюстраций, до 100 тысяч рублей.", "output": "Для создания иллюстраций с бюджетом до 100 тысяч рублей подойдёт ASUS ZenBook 13 OLED. Его цена около 99 000 рублей."}
{"input": "Какой ноутбук выбрать для просмотра сериалов, до 40 тысяч рублей?", "output": "Для просмотра сериалов с бюджетом до 40 тысяч рублей подойдёт Lenovo IdeaPad 3 14ADA6. Его цена около 38 000 рублей."}
{"input": "Мне нужен ноутбук для разработки мобильных приложений, до 200 тысяч рублей.", "output": "Для разработки мобильных приложений с бюджетом до 200 тысяч рублей подойдёт Dell XPS 13 Plus. Его цена около 198 000 рублей."}
{"input": "Какой ноутбук взять для редактирования текстов, до 20 тысяч рублей?", "output": "Для редактирования текстов с бюджетом до 20 тысяч рублей подойдёт HP Chromebook 11. Его цена около 19 000 рублей."}
{"input": "Посоветуйте ноутбук для домашнего использования, до 45 тысяч рублей.", "output": "Для домашнего использования с бюджетом до 45 тысяч рублей подойдёт ASUS E410MA. Его цена около 43 000 рублей."}
{"input": "Нужен ноутбук для редактирования фото и видео, до 150 тысяч рублей.", "output": "Для редактирования фото и видео с бюджетом до 150 тысяч рублей подойдёт ASUS ProArt Studiobook 15. Его цена около 148 000 рублей."}
{"input": "Какой ноутбук взять для создания 2D-анимации, до 70 тысяч рублей?", "output": "Для создания 2D-анимации с бюджетом до 70 тысяч рублей подойдёт Acer Nitro 5. Его цена около 69 000 рублей."}
{"input": "Ищу лэптоп для проведения онлайн-уроков, до 60 тысяч рублей.", "output": "Для проведения онлайн-уроков с бюджетом до 60 тысяч рублей подойдёт Lenovo ThinkPad E14. Его цена около 59 000 рублей."}
{"input": "Подскажите ноутбук для дизайна интерьеров, до 200 тысяч рублей.", "output": "Для дизайна интерьеров с бюджетом до 200 тысяч рублей подойдёт MSI Prestige 15. Его цена около 198 000 рублей."}
{"input": "Какой ноутбук выбрать для стриминга, до 120 тысяч рублей?", "output": "Для стриминга с бюджетом до 120 тысяч рублей подойдёт ASUS ROG Strix G15. Его цена около 119 000 рублей."}
{"input": "Мне нужен ноутбук для машинного обучения, до 250 тысяч рублей.", "output": "Для машинного обучения с бюджетом до 250 тысяч рублей подойдёт Razer Blade 14. Его цена около 248 000 рублей."}
{"input": "Какой недорогой ноутбук выбрать для онлайн-занятий школьнику?", "output": "Для онлайн-занятий школьнику с ограниченным бюджетом подойдёт ASUS Chromebook C223. Его цена около 25 000 рублей."}
{"input": "Нужен ноутбук для фрилансера, работающего с текстами и таблицами, до 50 тысяч.", "output": "Для фрилансера с бюджетом до 50 тысяч рублей подойдёт Lenovo V15. Его цена около 48 000 рублей."}
{"input": "Ищу ноутбук для работы с архитектурными проектами, до 150 тысяч рублей.", "output": "Для работы с архитектурными проектами с бюджетом до 150 тысяч рублей подойдёт Dell Precision 3551. Его цена около 149 000 рублей."}
{"input": "Подскажите лэптоп для начинающего дизайнера, до 100 тысяч рублей.", "output": "Для начинающего дизайнера с бюджетом до 100 тысяч рублей подойдёт ASUS VivoBook Pro 15 OLED. Его цена около 98 000 рублей."}
{"input": "Какой ноутбук взять для просмотра фильмов и сериалов, до 30 тысяч рублей?", "output": "Для просмотра фильмов и сериалов с бюджетом до 30 тысяч рублей подойдёт HP Chromebook x360. Его цена около 28 000 рублей."}
{"input": "Мне нужен ноутбук для преподавателя, до 70 тысяч рублей.", "output": "Для преподавателя с бюджетом до 70 тысяч рублей подойдёт Acer Aspire 5 A515. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы в AutoCAD, до 200 тысяч рублей?", "output": "Для работы в AutoCAD с бюджетом до 200 тысяч рублей подойдёт HP ZBook Firefly 14 G8. Его цена около 198 000 рублей."}
{"input": "Ищу ноутбук для офисной работы, до 40 тысяч рублей.", "output": "Для офисной работы с бюджетом до 40 тысяч рублей подойдёт Dell Latitude 3190. Его цена около 39 000 рублей."}
{"input": "Какой лэптоп выбрать для стриминга и монтажа видео, до 150 тысяч рублей?", "output": "Для стриминга и монтажа видео с бюджетом до 150 тысяч рублей подойдёт MSI Katana GF66. Его цена около 148 000 рублей."}
{"input": "Нужен ноутбук для обучения программированию, до 70 тысяч рублей.", "output": "Для обучения программированию с бюджетом до 70 тысяч рублей подойдёт Acer Swift 3. Его цена около 69 000 рублей."}
{"input": "Какой ноутбук взять для создания подкастов, до 100 тысяч рублей?", "output": "Для создания подкастов с бюджетом до 100 тысяч рублей подойдёт Lenovo Yoga Slim 7. Его цена около 98 000 рублей."}
{"input": "Посоветуйте ноутбук для работы с чертежами, до 90 тысяч рублей.", "output": "Для работы с чертежами с бюджетом до 90 тысяч рублей подойдёт HP Pavilion x360. Его цена около 88 000 рублей."}
{"input": "Ищу лэптоп для разработки игр, до 250 тысяч рублей.", "output": "Для разработки игр с бюджетом до 250 тысяч рублей подойдёт Alienware x15 R2. Его цена около 248 000 рублей."}
{"input": "Какой ноутбук выбрать для ребёнка для игр и обучения, до 50 тысяч рублей?", "output": "Для игр и обучения ребёнка с бюджетом до 50 тысяч рублей подойдёт Lenovo IdeaPad Gaming 3. Его цена около 49 000 рублей."}
{"input": "Мне нужен ноутбук для рисования в графических редакторах, до 80 тысяч рублей.", "output": "Для рисования в графических редакторах с бюджетом до 80 тысяч рублей подойдёт Acer ConceptD 3. Его цена около 78 000 рублей."}
{"input": "Какой ноутбук подойдёт для чтения документов и интернета, до 20 тысяч рублей?", "output": "Для чтения документов и интернета с бюджетом до 20 тысяч рублей подойдёт Lenovo IdeaPad Slim 1. Его цена около 18 000 рублей."}
{"input": "Посоветуйте ноутбук для редактирования музыки, до 150 тысяч рублей.", "output": "Для редактирования музыки с бюджетом до 150 тысяч рублей подойдёт Apple MacBook Pro 13\" (M1). Его цена около 145 000 рублей."}
{"input": "Ищу ноутбук для цифрового искусства, до 100 тысяч рублей.", "output": "Для цифрового искусства с бюджетом до 100 тысяч рублей подойдёт Microsoft Surface Laptop 4. Его цена около 99 000 рублей."}
{"input": "Какой ноутбук взять для ведения учёта и работы с таблицами, до 60 тысяч рублей?", "output": "Для ведения учёта и работы с таблицами с бюджетом до 60 тысяч рублей подойдёт ASUS ExpertBook P1. Его цена около 59 000 рублей."}
{"input": "Нужен ноутбук для простых офисных задач, до 25 тысяч рублей.", "output": "Для простых офисных задач с бюджетом до 25 тысяч рублей подойдёт Acer Chromebook 311. Его цена около 24 000 рублей."}
{"input": "Подскажите ноутбук для видеомонтажа на профессиональном уровне, до 200 тысяч рублей.", "output": "Для профессионального видеомонтажа с бюджетом до 200 тысяч рублей подойдёт ASUS ProArt Studiobook 16. Его цена около 198 000 рублей."}
{"input": "Какой ноутбук выбрать для дистанционного обучения, до 30 тысяч рублей?", "output": "Для дистанционного обучения с бюджетом до 30 тысяч рублей подойдёт Lenovo IdeaPad Slim 3 Chromebook. Его цена около 29 000 рублей."}
{"input": "Ищу ноутбук для работы в Photoshop, до 100 тысяч рублей.", "output": "Для работы в Photoshop с бюджетом до 100 тысяч рублей подойдёт Dell Inspiron 15 5515. Его цена около 98 000 рублей."}
{"input": "Какой ноутбук взять для общения в видеочатах, до 40 тысяч рублей?", "output": "Для общения в видеочатах с бюджетом до 40 тысяч рублей подойдёт HP Stream Laptop 14. Его цена около 38 000 рублей."}
{"input": "Мне нужен ноутбук для начинающего видеомонтажа, до 70 тысяч рублей.", "output": "Для начинающего видеомонтажа с бюджетом до 70 тысяч рублей подойдёт Acer Aspire 7. Его цена около 69 000 рублей."}
{"input": "Какой ноутбук подойдёт для написания диплома, до 50 тысяч рублей?", "output": "Для написания диплома с бюджетом до 50 тысяч рублей подойдёт Lenovo ThinkBook 15. Его цена около 48 000 рублей."}
{"input": "Посоветуйте ноутбук для веб-разработки, до 120 тысяч рублей.", "output": "Для веб-разработки с бюджетом до 120 тысяч рублей подойдёт ASUS Vivobook Pro 14X OLED. Его цена около 118 000 рублей."}
{"input": "Нужен ноутбук для видеозвонков и работы с документами, до 30 тысяч рублей.", "output": "Для видеозвонков и работы с документами с бюджетом до 30 тысяч рублей подойдёт ASUS Chromebook CX1. Его цена около 28 000 рублей."}
{"input": "Какой ноутбук выбрать для профессиональной обработки фото, до 150 тысяч рублей?", "output": "Для профессиональной обработки фото с бюджетом до 150 тысяч рублей подойдёт Dell XPS 13. Его цена около 149 000 рублей."}
{"input": "Ищу ноутбук для школьника, чтобы играть и учиться. Бюджет до 40 тысяч.", "output": "Для игр и учёбы школьника с бюджетом до 40 тысяч рублей подойдёт HP 255 G8. Его цена около 38 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы с 3D-графикой, если бюджет не ограничен?", "output": "Для работы с 3D-графикой без ограничений по бюджету подойдёт ASUS ProArt Studiobook 16 OLED. Его цена около 450 000 рублей."}
{"input": "Мне нужен недорогой ноутбук для текстового редактора, до 20 тысяч рублей.", "output": "Для работы в текстовом редакторе с бюджетом до 20 тысяч рублей подойдёт Lenovo Chromebook C330. Его цена около 18 000 рублей."}
{"input": "Посоветуйте ноутбук для стриминга игр, до 100 тысяч рублей.", "output": "Для стриминга игр с бюджетом до 100 тысяч рублей подойдёт ASUS ROG Strix G15. Его цена около 99 000 рублей."}
{"input": "Какой ноутбук выбрать для монтажа видео на профессиональном уровне, если бюджет не важен?", "output": "Для профессионального монтажа видео без ограничений по бюджету подойдёт Apple MacBook Pro 16\" (M2 Max). Его цена около 400 000 рублей."}
{"input": "Мне нужен лэптоп для работы в офисе и иногда для просмотра фильмов. Бюджет до 30 тысяч.", "output": "Для офисной работы и просмотра фильмов с бюджетом до 30 тысяч рублей подойдёт Acer Aspire 1. Его цена около 28 000 рублей."}
{"input": "Ищу ноутбук для работы с большими объёмами данных, до 150 тысяч рублей.", "output": "Для работы с большими объёмами данных с бюджетом до 150 тысяч рублей подойдёт HP Envy 15. Его цена около 148 000 рублей."}
{"input": "Какой ноутбук подойдёт для учёбы в университете? Бюджет до 50 тысяч.", "output": "Для учёбы в университете с бюджетом до 50 тысяч рублей подойдёт Dell Inspiron 3511. Его цена около 48 000 рублей."}
{"input": "Мне нужен игровой ноутбук с хорошей производительностью, до 200 тысяч рублей.", "output": "Для игр с хорошей производительностью и бюджетом до 200 тысяч рублей подойдёт MSI Pulse GL66. Его цена около 198 000 рублей."}
{"input": "Посоветуйте ноутбук для обработки фото на среднем уровне, до 70 тысяч рублей.", "output": "Для обработки фото на среднем уровне с бюджетом до 70 тысяч рублей подойдёт ASUS ZenBook 14. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук подойдёт для написания программ на Python? Бюджет до 60 тысяч рублей.", "output": "Для написания программ на Python с бюджетом до 60 тысяч рублей подойдёт Acer Aspire 5. Его цена около 58 000 рублей."}
{"input": "Ищу ноутбук для виртуальной реальности, до 250 тысяч рублей.", "output": "Для виртуальной реальности с бюджетом до 250 тысяч рублей подойдёт Alienware m15 R7. Его цена около 245 000 рублей."}
{"input": "Какой ноутбук взять для веб-дизайна? Бюджет до 120 тысяч рублей.", "output": "Для веб-дизайна с бюджетом до 120 тысяч рублей подойдёт Dell XPS 13 Plus. Его цена около 119 000 рублей."}
{"input": "Нужен ноутбук для видеоконференций и работы с документами, до 50 тысяч рублей.", "output": "Для видеоконференций и работы с документами с бюджетом до 50 тысяч рублей подойдёт HP 14s. Его цена около 48 000 рублей."}
{"input": "Ищу ноутбук для 4K видеомонтажа, до 300 тысяч рублей.", "output": "Для 4K видеомонтажа с бюджетом до 300 тысяч рублей подойдёт Apple MacBook Pro 14\" (M2 Pro). Его цена около 298 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы с машинным обучением? Бюджет до 200 тысяч рублей.", "output": "Для работы с машинным обучением с бюджетом до 200 тысяч рублей подойдёт ASUS ROG Zephyrus G15. Его цена около 198 000 рублей."}
{"input": "Посоветуйте ноутбук для редактирования фотографий в Lightroom, до 90 тысяч рублей.", "output": "Для редактирования фотографий в Lightroom с бюджетом до 90 тысяч рублей подойдёт HP Spectre x360. Его цена около 88 000 рублей."}
{"input": "Мне нужен бюджетный ноутбук для работы с Google Docs. До 20 тысяч рублей.", "output": "Для работы с Google Docs с бюджетом до 20 тысяч рублей подойдёт ASUS Chromebook CX22. Его цена около 18 500 рублей."}
{"input": "Какой ноутбук выбрать для написания статей и блогов? Бюджет до 40 тысяч.", "output": "Для написания статей и блогов с бюджетом до 40 тысяч рублей подойдёт Lenovo IdeaPad 1. Его цена около 39 000 рублей."}
{"input": "Ищу ноутбук для детей, чтобы смотреть мультики и учиться. Бюджет до 30 тысяч.", "output": "Для детей с бюджетом до 30 тысяч рублей подойдёт HP Chromebook 14. Его цена около 29 000 рублей."}
{"input": "Какой ноутбук подойдёт для монтажа музыкальных видео? Бюджет до 120 тысяч рублей.", "output": "Для монтажа музыкальных видео с бюджетом до 120 тысяч рублей подойдёт ASUS Vivobook Pro 15. Его цена около 118 000 рублей."}
{"input": "Мне нужен лэптоп для онлайн-курсов и вебинаров. До 50 тысяч рублей.", "output": "Для онлайн-курсов и вебинаров с бюджетом до 50 тысяч рублей подойдёт Acer Swift 1. Его цена около 48 000 рублей."}
{"input": "Какой ноутбук выбрать для компиляции больших программ? Бюджет до 150 тысяч рублей.", "output": "Для компиляции больших программ с бюджетом до 150 тысяч рублей подойдёт Lenovo Legion 5 Pro. Его цена около 149 000 рублей."}
{"input": "Ищу ноутбук для игр в 4K разрешении. Бюджет до 250 тысяч рублей.", "output": "Для игр в 4K разрешении с бюджетом до 250 тысяч рублей подойдёт ASUS ROG Strix SCAR 17. Его цена около 248 000 рублей."}
{"input": "Нужен ноутбук для проектирования интерьеров. До 200 тысяч рублей.", "output": "Для проектирования интерьеров с бюджетом до 200 тысяч рублей подойдёт HP ZBook Studio G8. Его цена около 198 000 рублей."}
{"input": "Посоветуйте ноутбук для начинающего архитектора. До 70 тысяч рублей.", "output": "Для начинающего архитектора с бюджетом до 70 тысяч рублей подойдёт ASUS VivoBook 15. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук выбрать для онлайн-игр? Бюджет до 100 тысяч рублей.", "output": "Для онлайн-игр с бюджетом до 100 тысяч рублей подойдёт MSI GF65 Thin. Его цена около 98 000 рублей."}
{"input": "Ищу ноутбук для просмотра фильмов в 4K. Бюджет до 60 тысяч рублей.", "output": "Для просмотра фильмов в 4K с бюджетом до 60 тысяч рублей подойдёт HP Pavilion 15. Его цена около 59 000 рублей."}
{"input": "Какой ноутбук подойдёт для редактирования видео на YouTube? До 90 тысяч рублей.", "output": "Для редактирования видео на YouTube с бюджетом до 90 тысяч рублей подойдёт Acer ConceptD 5. Его цена около 89 000 рублей."}
{"input": "Мне нужен лэптоп для создания презентаций. Бюджет до 40 тысяч рублей.", "output": "Для создания презентаций с бюджетом до 40 тысяч рублей подойдёт ASUS VivoBook E410. Его цена около 38 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы с big data? Бюджет до 250 тысяч рублей.", "output": "Для работы с big data с бюджетом до 250 тысяч рублей подойдёт Lenovo ThinkPad P15. Его цена около 248 000 рублей."}
{"input": "Ищу ноутбук для учёбы в школе. До 30 тысяч рублей.", "output": "Для учёбы в школе с бюджетом до 30 тысяч рублей подойдёт Lenovo IdeaPad Slim 1. Его цена около 28 000 рублей."}
{"input": "Какой ноутбук выбрать для стриминга фильмов? Бюджет до 40 тысяч рублей.", "output": "Для стриминга фильмов с бюджетом до 40 тысяч рублей подойдёт HP Chromebook x360. Его цена около 39 000 рублей."}
{"input": "Мне нужен ноутбук для начальной работы с 3D моделированием. До 100 тысяч рублей.", "output": "Для начальной работы с 3D моделированием с бюджетом до 100 тысяч рублей подойдёт ASUS TUF Gaming A15. Его цена около 98 000 рублей."}
{"input": "Посоветуйте ноутбук для домашнего использования. До 50 тысяч рублей.", "output": "Для домашнего использования с бюджетом до 50 тысяч рублей подойдёт Dell Inspiron 15 3000. Его цена около 49 000 рублей."}
{"input": "Какой ноутбук выбрать для программирования на Java? До 80 тысяч рублей.", "output": "Для программирования на Java с бюджетом до 80 тысяч рублей подойдёт Lenovo ThinkPad E14. Его цена около 78 000 рублей."}
{"input": "Мне нужен лэптоп для работы с таблицами Excel. Бюджет до 30 тысяч рублей.", "output": "Для работы с таблицами Excel с бюджетом до 30 тысяч рублей подойдёт Acer Aspire 3. Его цена около 28 000 рублей."}
{"input": "Посоветуйте ноутбук для редактирования текстов и чтения книг. До 40 тысяч рублей.", "output": "Для редактирования текстов и чтения книг с бюджетом до 40 тысяч рублей подойдёт ASUS E410. Его цена около 38 000 рублей."}
{"input": "Какой ноутбук выбрать для стриминга на Twitch? До 150 тысяч рублей.", "output": "Для стриминга на Twitch с бюджетом до 150 тысяч рублей подойдёт MSI Stealth 15M. Его цена около 148 000 рублей."}
{"input": "Ищу ноутбук для рисования в графических редакторах. Бюджет до 100 тысяч рублей.", "output": "Для рисования в графических редакторах с бюджетом до 100 тысяч рублей подойдёт HP Spectre x360 14. Его цена около 98 000 рублей."}
{"input": "Какой ноутбук подойдёт для игры в Minecraft? До 50 тысяч рублей.", "output": "Для игры в Minecraft с бюджетом до 50 тысяч рублей подойдёт Lenovo IdeaPad Gaming 3. Его цена около 49 000 рублей."}
{"input": "Нужен лэптоп для запуска виртуальных машин. Бюджет до 200 тысяч рублей.", "output": "Для запуска виртуальных машин с бюджетом до 200 тысяч рублей подойдёт ASUS ROG Zephyrus M16. Его цена около 199 000 рублей."}
{"input": "Посоветуйте ноутбук для записи подкастов и обработки аудио. До 90 тысяч рублей.", "output": "Для записи подкастов и обработки аудио с бюджетом до 90 тысяч рублей подойдёт Apple MacBook Air 13\" (M1). Его цена около 88 000 рублей."}
{"input": "Какой ноутбук выбрать для начинающего графического дизайнера? До 60 тысяч рублей.", "output": "Для начинающего графического дизайнера с бюджетом до 60 тысяч рублей подойдёт Dell Inspiron 15 3000. Его цена около 59 000 рублей."}
{"input": "Ищу ноутбук для путешествий и редактирования фото. До 120 тысяч рублей.", "output": "Для путешествий и редактирования фото с бюджетом до 120 тысяч рублей подойдёт LG Gram 14. Его цена около 118 000 рублей."}
{"input": "Какой ноутбук подойдёт для 2D-анимации? До 80 тысяч рублей.", "output": "Для 2D-анимации с бюджетом до 80 тысяч рублей подойдёт Acer ConceptD 3. Его цена около 78 000 рублей."}
{"input": "Мне нужен лэптоп для работы с САПР. До 150 тысяч рублей.", "output": "Для работы с САПР с бюджетом до 150 тысяч рублей подойдёт HP ZBook Power G9. Его цена около 149 000 рублей."}
{"input": "Посоветуйте ноутбук для учёбы и просмотра фильмов. Бюджет до 50 тысяч рублей.", "output": "Для учёбы и просмотра фильмов с бюджетом до 50 тысяч рублей подойдёт ASUS VivoBook 15. Его цена около 48 000 рублей."}
{"input": "Какой ноутбук выбрать для разработки игр? Бюджет до 200 тысяч рублей.", "output": "Для разработки игр с бюджетом до 200 тысяч рублей подойдёт Lenovo Legion 7. Его цена около 198 000 рублей."}
{"input": "Ищу ноутбук для создания влогов и обработки видео. До 100 тысяч рублей.", "output": "Для создания влогов и обработки видео с бюджетом до 100 тысяч рублей подойдёт ASUS ZenBook Flip 15. Его цена около 98 000 рублей."}
{"input": "Какой ноутбук подойдёт для работы с текстами и создания презентаций? До 40 тысяч рублей.", "output": "Для работы с текстами и создания презентаций с бюджетом до 40 тысяч рублей подойдёт Lenovo IdeaPad 3. Его цена около 39 000 рублей."}
{"input": "Нужен ноутбук для монтажа 4K-видео. Бюджет до 250 тысяч рублей.", "output": "Для монтажа 4K-видео с бюджетом до 250 тысяч рублей подойдёт Apple MacBook Pro 14\" (M2 Pro). Его цена около 248 000 рублей."}
{"input": "Посоветуйте лэптоп для учёбы на дизайнера. Бюджет до 70 тысяч рублей.", "output": "Для учёбы на дизайнера с бюджетом до 70 тысяч рублей подойдёт Acer Swift 3. Его цена около 68 000 рублей."}
{"input": "Какой ноутбук подойдёт для домашнего использования и игр? До 60 тысяч рублей.", "output": "Для домашнего использования и игр с бюджетом до 60 тысяч рублей подойдёт Lenovo Legion 5. Его цена около 59 000 рублей."}
{"input": "Мне нужен ноутбук для начинающего программиста. До 50 тысяч рублей.", "output": "Для начинающего программиста с бюджетом до 50 тысяч рублей подойдёт ASUS VivoBook S14. Его цена около 48 000 рублей."}
{"input": "Ищу ноутбук для просмотра фильмов в Full HD. Бюджет до 30 тысяч рублей.", "output": "Для просмотра фильмов в Full HD с бюджетом до 30 тысяч рублей подойдёт HP 15s. Его цена около 28 000 рублей."}
